Обработки/Reports/_ОтчетностьВПФР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетностьВПФР</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВывестиПечатнуюФорму</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьВXML</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПустоеЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтчетности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель_Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель_Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель_Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель_Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель_Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель_ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контролер_Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контролер_Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контролер_Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контролер_Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контролер_Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контролер_Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресВременногоХранилища</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаРегистра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаКасса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиОтчета</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеСопроводительногоПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель_Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель_Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель_Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель_Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель_Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель_Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказатьРуководителя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьВXBRL</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогXBRL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяПодтверждениеСпецДепа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный_Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный_Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный_Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный_Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный_Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаВознагражденияУК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаУслугСпецдепозитария</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасхожденияИННиОГРН</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЮрФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИННИзСправочника</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПолное</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РегистрБанки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Банк_БИК</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта_Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Резидент</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЛица</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОКСМ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетностьВПФР/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область События_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	НаименованиеГоловнойОрганизации = ПолучитьНаименованиеГоловнойОрганизации();
	
	Отчет.ДатаОтчетности		= КонецМесяца(ДобавитьМесяц(ТекущаяДата(), -1));
	Отчет.ВалютаУчета			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Отчет.Организация, "ВалютаУчета");
	
	ДатаОтчетностиПриИзмененииНаСервере();
		
	ЗаполнитьСписокКонтактныхЛиц();
			
	НастройкиВидимостиРеквизитов = РеквизитФормыВЗначение("Отчет").ПолучитьНастройкиВидимостиРеквизитов();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ВариантОтчетаПриИзменении("");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	СохранитьДанныеВНастройки(Отчет.ВариантОтчета);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстСообщения = "";
	
	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.Период,,, ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Отчет.Период", Отказ);	
	КонецЕсли;
	
	Если ТекущаяДата() <= Отчет.Период.ДатаОкончания Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата окончания периода не должна превышать текущую дату " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy"),,, "Отчет.Период", Отказ);
	КонецЕсли;
	
	Если Отчет.ВыгружатьВXML Тогда
		Если НЕ ЗначениеЗаполнено(Отчет.КаталогДанных) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите каталог данных",,, "Отчет.КаталогДанных", Отказ);
		КонецЕсли;
	КонецЕсли;
			
	Если Не ЗначениеЗаполнено(Отчет.СчетДоверительногоУправления) Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите счет доверительного управления",,, "Отчет.СчетДоверительногоУправления", Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область События_элементов_формы

&НаКлиенте
Процедура ПутьВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	Диалог.Каталог            = Отчет.КаталогДанных; 
	Диалог.МножественныйВыбор = Ложь; 
	Диалог.Заголовок          = "Выберите каталог"; 
	
	Если Диалог.Выбрать() Тогда 
		Отчет.КаталогДанных = Диалог.Каталог;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьВыгрузкиОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(Отчет.КаталогДанных + "\");

КонецПроцедуры

&НаКлиенте
Процедура ФамилияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РезультатВыбора = СписокКонтактныхЛиц.ВыбратьЭлемент();
	
	Если РезультатВыбора <> Неопределено Тогда
		Если Элемент = Элементы.Контролер_Фамилия Тогда
			ИмяЭлемента = "Контролер";		
		ИначеЕсли Элемент = Элементы.Руководитель_Фамилия Тогда
			ИмяЭлемента = "Руководитель";			
		Иначе
			Возврат;
		КонецЕсли;
		
		ЗаполнитьФИО(ИмяЭлемента, РезультатВыбора.Значение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Отчет.ДатаОтчетности = Отчет.Период.ДатаОкончания;
	
	Отчет.КаталогДанных = ПолучитьИмяФайлаОпераций(Отчет.Организация, Отчет.ВариантОтчета, Отчет.Период.ДатаОкончания, Отчет.КаталогДанных);
		
КонецПроцедуры

&НаКлиенте
Процедура ВариантОтчетаПриИзменении(Элемент)
	
	ВосстановитьДанныеИзНастроек(Отчет.ВариантОтчета);
	
	Элементы.СчетДоверительногоУправления	.Видимость = ВидимостьРеквизита("СчетДоверительногоУправления");
	Элементы.ГруппаСтавки					.Видимость = ВидимостьРеквизита("ГруппаСтавки");
	
	Элементы.ГруппаВыгружатьВXML	.Видимость = ВидимостьРеквизита("ГруппаВыгружатьВXML");
	Элементы.ВывестиПечатнуюФорму	.Видимость = ВидимостьРеквизита("ВывестиПечатнуюФорму");
	
	Отчет.ВывестиПечатнуюФорму = Элементы.ВывестиПечатнуюФорму.Видимость;
		
	ЭтоНеОКУД = (Отчет.ВариантОтчета = "ИнвестированиеСредствПенсионныхНакоплений" ИЛИ Отчет.ВариантОтчета = "ДоходыОтИнвестированияСредствПенсионныхНакоплений");
	Элементы.ВыгружатьВXML.Заголовок = ?(ЭтоНеОКУД, "Выгружать в XML", "Выгружать в Анкету");
	
	УстановитьПериодОтчетаПоУмолчанию();
	
	Отчет.КаталогДанных = ПолучитьИмяФайлаОпераций(Отчет.Организация, Отчет.ВариантОтчета, Отчет.Период.ДатаОкончания, Отчет.КаталогДанных);
			
КонецПроцедуры

&НаКлиенте
Процедура ВариантОтчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СохранитьДанныеВНастройки(Отчет.ВариантОтчета);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанныеВНастройки(ВариантОтчета)
	
	СохраняемыеРеквизиты = ПолучитьСохраняемыеРеквизиты();
	
	ЗаполнитьЗначенияСвойств(СохраняемыеРеквизиты, Отчет);
	ЗаполнитьЗначенияСвойств(СохраняемыеРеквизиты, ЭтаФорма);
	
	ПараметрыПоиска = Новый Структура("Организация,ВариантОтчета", Отчет.Организация, ВариантОтчета);
	НайденныеСтроки = Отчет.НастройкиОтчета.НайтиСтроки(ПараметрыПоиска);
	Для Каждого СтрокаНастройки Из НайденныеСтроки Цикл
		Отчет.НастройкиОтчета.Удалить(СтрокаНастройки);
	КонецЦикла;
	
	Для Каждого Реквизит Из СохраняемыеРеквизиты Цикл
		СтрокаНастройки = Отчет.НастройкиОтчета.Добавить();
		СтрокаНастройки.Организация		= Отчет.Организация;
		СтрокаНастройки.ВариантОтчета	= Отчет.ВариантОтчета;
		СтрокаНастройки.Ключ			= Реквизит.Ключ;
		СтрокаНастройки.Значение		= Реквизит.Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОтчетностиПриИзменении(Элемент)
	
	ДатаОтчетностиПриИзмененииНаСервере();	
	УстановитьПериодОтчетаПоУмолчанию();
	
КонецПроцедуры

&НаСервере
Процедура ДатаОтчетностиПриИзмененииНаСервере()
		
	ПредпоследняяРабочаяПредПредыдущегоКвартала	= Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, КонецКвартала(ДобавитьМесяц(Отчет.ДатаОтчетности, -6)));	
	ПоследняяРабочаяДатаВМесяцеДатыОтчетности = Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, КонецМесяца(Отчет.ДатаОтчетности));
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатВыбор(Элемент, Область, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
		
	ТекОбласть = Элемент.ТекущаяОбласть.Имя;
	
	НайдНомерКолонки = СтрНайти(ТекОбласть, "C");
	Если НайдНомерКолонки = 0 Тогда
		Сообщить("Неверное имя ячейки");
		Возврат;
	КонецЕсли;
	
	// Если выбран диапазон ячеек, тоже исключаем
	Если СтрНайти(ТекОбласть, ":") > 0 Тогда
		Сообщить("Для данной ячейки расшифровка отсутствует!");
		Возврат;
	КонецЕсли;
	
	НомерСтроки		= Число(Сред(ТекОбласть, 2, НайдНомерКолонки - 2));
	НомерКолонки	= Число(Сред(ТекОбласть, НайдНомерКолонки + 1));
	
	// строки 21 и 24, столбцы 3 и 4
	Если Не((НомерСтроки = 21 Или НомерСтроки = 24) И (НомерКолонки = 3 Или НомерКолонки = 4)) Тогда
		Сообщить("Для данной ячейки расшифровка отсутствует!");
		Возврат;	
	КонецЕсли;
		
	Расшифровка = СформироватьРасшифровкуНаСервере(НомерСтроки, НомерКолонки);
	Если Расшифровка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФормыРасшифровки = Лев(ЭтотОбъект.ИмяФормы, СтрНайти(ЭтотОбъект.ИмяФормы, ".", НаправлениеПоиска.СКонца)) + "ФормаРасшифровки";
	
	ФормаРасшифровки = ПолучитьФорму(ИмяФормыРасшифровки, , ЭтаФорма);  
	ФормаРасшифровки.Расшифровка = Расшифровка;
	
	Если ФормаРасшифровки.Открыта() Тогда
		ФормаРасшифровки.Активизировать();		
	Иначе
		ФормаРасшифровки.Открыть();
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти

#Область Команды_формы

&НаКлиенте
Процедура КомандаСформировать(Команда)
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоНеОКУД = (Отчет.ВариантОтчета = "ИнвестированиеСредствПенсионныхНакоплений" ИЛИ Отчет.ВариантОтчета = "ДоходыОтИнвестированияСредствПенсионныхНакоплений");
				
	Отчет.ВыгружатьВXML		= Мин(Элементы.ГруппаВыгружатьВXML.Видимость, Отчет.ВыгружатьВXML);
	
	СформироватьПакетыДанных();    	
	
	Если Отчет.ВыгружатьВXML И ЭтоНеОКУД Тогда
		СформироватьXML_НеОКУД();
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область Прочие_процедуры_и_функции

&НаСервере
Процедура ЗаполнитьФИО(ИмяЭлемента, КонтактноеЛицо)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыСотрудниковОрганизацииСрезПоследних.Фамилия КАК Фамилия,
		|	РеквизитыСотрудниковОрганизацииСрезПоследних.Имя КАК Имя,
		|	РеквизитыСотрудниковОрганизацииСрезПоследних.Отчество КАК Отчество,
		|	КонтактнаяИнформацияСрезПоследних.Представление КАК Телефон,
		|	КонтактныеЛица.Должность КАК Должность
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(&Период, ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)) КАК СвязанныеЮридическиеЛицаСрезПоследних
		|		ПО Организации.ЮрФизЛицо = СвязанныеЮридическиеЛицаСрезПоследних.ЮридическоеЛицо
		|			И (СвязанныеЮридическиеЛицаСрезПоследних.Действует)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.Телефон)) КАК КонтактнаяИнформацияСрезПоследних
		|		ПО (ЕСТЬNULL(СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо, Организации.ЮрФизЛицо) = КонтактнаяИнформацияСрезПоследних.Объект)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактныеЛица КАК КонтактныеЛица
		|		ПО Организации.ЮрФизЛицо = КонтактныеЛица.Объект
		|			И (КонтактныеЛица.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний))
		|			И (КонтактныеЛица.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|			И (КонтактныеЛица.КонтактноеЛицо = &КонтактноеЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыСотрудниковОрганизации.СрезПоследних(
		|				&Период,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Организация = &Организация
		|					И ЮрФизЛицо = &КонтактноеЛицо) КАК РеквизитыСотрудниковОрганизацииСрезПоследних
		|		ПО (ИСТИНА)
		|ГДЕ
		|	Организации.Ссылка = &Организация";
		
	Запрос.УстановитьПараметр("Организация"		, Отчет.Организация);
	Запрос.УстановитьПараметр("КонтактноеЛицо"	, КонтактноеЛицо);
	Запрос.УстановитьПараметр("Период"			, Отчет.ДатаОтчетности);
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Отчет[ИмяЭлемента + "_Фамилия"]	= Выборка.Фамилия;
		Отчет[ИмяЭлемента + "_Имя"]		= Выборка.Имя;
		Отчет[ИмяЭлемента + "_Отчество"]	= Выборка.Отчество;
		Отчет[ИмяЭлемента + "_Должность"]	= Выборка.Должность;
		Отчет[ИмяЭлемента + "_Телефон"]	= Лев(Выборка.Телефон, Найти(Выборка.Телефон, ",") - 1);
		
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьСписокКонтактныхЛиц()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КонтактныеЛица.КонтактноеЛицо
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтактныеЛица КАК КонтактныеЛица
		|		ПО Организации.ЮрФизЛицо = КонтактныеЛица.Объект
		|			И (КонтактныеЛица.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний))
		|			И (КонтактныеЛица.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|ГДЕ
		|	Организации.Ссылка = &Организация
		|	И КонтактныеЛица.КонтактноеЛицо ССЫЛКА Справочник.ЮрФизЛица";
		
	Запрос.УстановитьПараметр("Организация", Отчет.Организация);
	СписокКонтактныхЛиц.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("КонтактноеЛицо"));
	
КонецПроцедуры	

&НаКлиенте
Процедура ВосстановитьДанныеИзНастроек(ВариантОтчета)
	
	СохраняемыеРеквизиты = Новый Структура;
	
	ПараметрыПоиска = Новый Структура("Организация,ВариантОтчета", Отчет.Организация, ВариантОтчета);
	НайденныеСтроки = Отчет.НастройкиОтчета.НайтиСтроки(ПараметрыПоиска);
	Для Каждого СтрокаНастройки Из НайденныеСтроки Цикл
		Если ЗначениеЗаполнено(СтрокаНастройки.Значение) Тогда
			СохраняемыеРеквизиты.Вставить(СтрокаНастройки.Ключ, СтрокаНастройки.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(Отчет		, СохраняемыеРеквизиты);
	ЗаполнитьЗначенияСвойств(ЭтаФорма	, СохраняемыеРеквизиты);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСохраняемыеРеквизиты()

	СохраняемыеРеквизиты = Новый Структура;
	СохраняемыеРеквизиты.Вставить("ВывестиПечатнуюФорму");
	СохраняемыеРеквизиты.Вставить("ВыгружатьВXML");
	СохраняемыеРеквизиты.Вставить("Контролер_Фамилия");
	СохраняемыеРеквизиты.Вставить("Контролер_Имя");
	СохраняемыеРеквизиты.Вставить("Контролер_Отчество");
	СохраняемыеРеквизиты.Вставить("Контролер_Телефон");
	СохраняемыеРеквизиты.Вставить("Контролер_Основание");
	СохраняемыеРеквизиты.Вставить("Контролер_Должность");
	СохраняемыеРеквизиты.Вставить("Руководитель_Фамилия");
	СохраняемыеРеквизиты.Вставить("Руководитель_Имя");
	СохраняемыеРеквизиты.Вставить("Руководитель_Отчество");
	СохраняемыеРеквизиты.Вставить("Руководитель_Должность");
	СохраняемыеРеквизиты.Вставить("Руководитель_Телефон");
	СохраняемыеРеквизиты.Вставить("УказатьРуководителя");	
	СохраняемыеРеквизиты.Вставить("СчетДоверительногоУправления");
	
	Возврат СохраняемыеРеквизиты;

КонецФункции

&НаКлиенте
Функция ВидимостьРеквизита(ИмяРеквизита)
	
	Видимость = Ложь;
	
	Если ЗначениеЗаполнено(Отчет.ВариантОтчета) Тогда
		Если НастройкиВидимостиРеквизитов.Свойство(Отчет.ВариантОтчета) Тогда
			Если НастройкиВидимостиРеквизитов[Отчет.ВариантОтчета].Свойство(ИмяРеквизита) Тогда
				Видимость = НастройкиВидимостиРеквизитов[Отчет.ВариантОтчета][ИмяРеквизита];
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Видимость;

КонецФункции

&НаКлиенте
Процедура УстановитьПериодОтчетаПоУмолчанию()
	
	Элементы.Период.Видимость = Истина;
	
	Если (Отчет.ВариантОтчета = "ИнвестированиеСредствПенсионныхНакоплений"
		ИЛИ Отчет.ВариантОтчета = "ДоходыОтИнвестированияСредствПенсионныхНакоплений") Тогда	
		
		Отчет.Период.ДатаОкончания = ПоследняяРабочаяДатаВМесяцеДатыОтчетности;                                    
		Отчет.Период.ДатаНачала	  = ПредпоследняяРабочаяПредПредыдущегоКвартала + 60 * 60 * 24;
		Если Отчет.Период.ДатаОкончания >= Дата(2018,12,29) Тогда
			Отчет.Период.ДатаОкончания = КонецКвартала(ПоследняяРабочаяДатаВМесяцеДатыОтчетности);
		КонецЕсли;   	
		
		Если Отчет.Период.ДатаОкончания >= Дата(2019,1,1) Тогда
			Отчет.Период.ДатаНачала = НачалоКвартала(ПоследняяРабочаяДатаВМесяцеДатыОтчетности);
		КонецЕсли;
		
	ИначеЕсли Отчет.ВариантОтчета = "РасчетДопустимогоРазмераНеобходимыхРасходов" Тогда	
		
		Отчет.Период.ДатаОкончания = ПоследняяРабочаяДатаВМесяцеДатыОтчетности;                                    
		Отчет.Период.ДатаНачала = НачалоГода(ПоследняяРабочаяДатаВМесяцеДатыОтчетности);                                    
		Если Отчет.Период.ДатаОкончания >= Дата(2018,12,29) Тогда
			Отчет.Период.ДатаОкончания = КонецКвартала(ПоследняяРабочаяДатаВМесяцеДатыОтчетности);
		КонецЕсли;   	
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура СформироватьПакетДанных(ИмяПакета)
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");

	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОтчетОбъект, "Организация,Период,ДатаОтчетности", Новый Структура("ИмяПакета", ИмяПакета));
	Механизм = ОтчетОбъект.Метаданные().ПолноеИмя() + ".СформироватьПакетДанных()";
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	ПакетДанных = Новый Структура;
	
	Если ИмяПакета = "ИнвестированиеСредствПенсионныхНакоплений" Тогда
		
		ПакетДанных	= ОтчетОбъект.ПолучитьДанные_ИнвестированиеСредствПенсионныхНакоплений(ЭтаФорма.ЕдиницаИзмерения);
		
		Если ПакетДанных.Свойство("Отказ") Тогда
			
			Если Сессия <> Неопределено Тогда
				РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
			КонецЕсли;
			
			Возврат;
			
		КонецЕсли;
				
		Если Отчет.ВывестиПечатнуюФорму Тогда
			ОтчетОбъект.ЗаполнитьПечатнуюФорму_ИнвестированиеСредствПенсионныхНакоплений(ПакетДанных, Результат, ЭтаФорма.ЕдиницаИзмерения);
		КонецЕсли;
		
	ИначеЕсли ИмяПакета = "ДоходыОтИнвестированияСредствПенсионныхНакоплений" Тогда
	
		ПакетДанных	= ОтчетОбъект.ПолучитьДанные_ДоходыОтИнвестированияСредствПенсионныхНакоплений(ЭтаФорма.ЕдиницаИзмерения);
		
		Если Отчет.ВывестиПечатнуюФорму Тогда
			ОтчетОбъект.ЗаполнитьПечатнуюФорму_ДоходыОтИнвестированияСредствПенсионныхНакоплений(ПакетДанных, Результат, ЭтаФорма.ЕдиницаИзмерения);
		КонецЕсли;
		
	ИначеЕсли ИмяПакета = "РасчетДопустимогоРазмераНеобходимыхРасходов" Тогда
		
		ПакетДанных	= ОтчетОбъект.ПолучитьДанные_РасчетДопустимогоРазмераНеобходимыхРасходов(ЭтаФорма.ЕдиницаИзмерения);
		
		Если Отчет.ВывестиПечатнуюФорму Тогда
			ОтчетОбъект.ЗаполнитьПечатнуюФорму_РасчетДопустимогоРазмераНеобходимыхРасходов(ПакетДанных, Результат, ЭтаФорма.ЕдиницаИзмерения);
		КонецЕсли;
		
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИмяФайла(Расширение)

	//проверка каталога	
	ПроверяемыйКаталог = Новый Файл(Отчет.КаталогДанных);
	Если НЕ ПроверяемыйКаталог.Существует() Тогда
		СоздатьКаталог(Отчет.КаталогДанных);
	КонецЕсли;	
	
	Версия = 1;
	
	Версионирование = Истина;
	
	Если (Отчет.ВариантОтчета = "ИнвестированиеСредствПенсионныхНакоплений" 
		ИЛИ Отчет.ВариантОтчета = "ДоходыОтИнвестированияСредствПенсионныхНакоплений"
		ИЛИ Отчет.ВариантОтчета = "РасчетДопустимогоРазмераНеобходимыхРасходов") Тогда
		ШаблонФайла		= Отчет.КаталогДанных + "\" + Отчет.ВариантОтчета + " за " + Формат(Отчет.Период.ДатаНачала, "ДФ=MMMM") + "-" + Формат(Отчет.Период.ДатаОкончания, "ДФ=MMMM") + " " + Формат(Отчет.Период.ДатаОкончания, "ДФ=yyyy") + " г. " + НаименованиеГоловнойОрганизации + " " + Строка(Отчет.СчетДоверительногоУправления);
		Версионирование = Ложь;
	Иначе
		ШаблонФайла		= Отчет.КаталогДанных + "\" + Отчет.ВариантОтчета + " за " + Формат(Отчет.Период.ДатаОкончания, "ДФ='MMMM yyyy'") + " " + НаименованиеГоловнойОрганизации;
	КонецЕсли;
	
	ШаблонФайла = СтрЗаменить(ШаблонФайла, """", "");
	
	Если Версионирование Тогда
		ИмяФайлаСРасширением = ШаблонФайла + " ver." + Строка(Версия) + Расширение;
		
		ПроверяемыйФайл = Новый Файл(ИмяФайлаСРасширением);
		Пока ПроверяемыйФайл.Существует() Цикл
			Версия = Версия + 1;
			ИмяФайлаСРасширением =  ШаблонФайла + " ver." + Строка(Версия) + Расширение;
			ПроверяемыйФайл = Новый Файл(ИмяФайлаСРасширением);
		КонецЦикла;
	Иначе
		ИмяФайлаСРасширением	=  ШаблонФайла + Расширение;		
	КонецЕсли;
	    	
	Возврат ИмяФайлаСРасширением;
	
КонецФункции
	
&НаСервере
Функция СформироватьРасшифровкуНаСервере(НомерСтроки, НомерКолонки)
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");		
	
	ПолеРасшифровки = ?(НомерСтроки = 21, "011", "014");
	СНачалаГода = НомерКолонки = 4;
	
	ВыборкаРасшифровки = ОтчетОбъект.ПолучитьВыборкуРасшифровкиЯчейки(ПолеРасшифровки, СНачалаГода, ЭтаФорма.ЕдиницаИзмерения);
	Если ВыборкаРасшифровки = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	ТабДокумент = Новый ТабличныйДокумент;
	
	Макет = ОтчетОбъект.ПолучитьМакет("Расшифровка" + ПолеРасшифровки);
		
	ОбластьШапка  	= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока 	= Макет.ПолучитьОбласть("Строка");
	ОбластьИтог		= Макет.ПолучитьОбласть("Итог");
		
	ТабДокумент.Вывести(ОбластьШапка);
		
	Если ВыборкаРасшифровки.Следующий() Тогда // Строка итогов
		ОбластьИтог.Параметры.Заполнить(ВыборкаРасшифровки);		
	КонецЕсли;
	
	Сч = 1;
	Пока ВыборкаРасшифровки.Следующий() Цикл
	
		ОбластьСтрока.Параметры.Заполнить(ВыборкаРасшифровки);
		ОбластьСтрока.Параметры.НомерСтроки = Сч;
		ТабДокумент.Вывести(ОбластьСтрока);
		Сч = Сч + 1;
	
	КонецЦикла;
	
	ТабДокумент.Вывести(ОбластьИтог);
	
	ТабДокумент.ТолькоПросмотр = Истина;	
	                  
	Возврат ТабДокумент;
	
КонецФункции

&НаКлиенте
Процедура СформироватьXML_НеОКУД()
	
	Если ПакетДанных.Свойство("Отказ") Тогда 
		Возврат; 
	КонецЕсли;
	
	ИмяФайлаXML = ПолучитьИмяФайла(".xml");
	
	ТекстФайла = ПолучитьМакет_НеОКУД();
	
	МассивДанных = ПакетДанных.Отчет["Раздел1_" + Отчет.ВариантОтчета].Таб_Отчет;
		
	Если МассивДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПодготовитьМассивДанных(МассивДанных[0], Отчет.ВариантОтчета, ЭтотОбъект.ЕдиницаИзмерения);
	
	Для Каждого ЭлементСтруктуры Из МассивДанных[0] Цикл
		ТекстФайла = СтрЗаменить(ТекстФайла, ЭлементСтруктуры.Ключ + "_Тэг", ЭлементСтруктуры.Значение);		
	КонецЦикла;
	
	ФайлXML = Новый ТекстовыйДокумент;
	ФайлXML.УстановитьТекст(ТекстФайла);	
	ФайлXML.Записать(ИмяФайлаXML, "windows-1251");
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отчёт сохранён в файл: " + ИмяФайлаXML);
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьМассивДанных(МассивДанных, ВариантОтчета, ЕдиницаИзмерения)
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.ПолучитьФорматированныеДанныеДляПечати(ВариантОтчета, МассивДанных, ЕдиницаИзмерения);	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМакет_НеОКУД()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	МакетСоответствия = ОтчетОбъект.ПолучитьМакет("СоответствиеВариантовОтчетаИВыгрузок");
	
	СоответствиеНазваний = Новый Структура;
		
	Для НомерСтроки = 2 По МакетСоответствия.ВысотаТаблицы Цикл
		
		ВариантОтчета		= СокрЛП(МакетСоответствия.Область(НомерСтроки, 1, НомерСтроки, 1).Текст);
		ИмяМакетаВыгрузки	= СокрЛП(МакетСоответствия.Область(НомерСтроки, 2, НомерСтроки, 2).Текст);		
				
		Если ВариантОтчета = "" Тогда
			Продолжить;
		КонецЕсли;
		
		СоответствиеНазваний.Вставить(ВариантОтчета, ИмяМакетаВыгрузки);
		
	КонецЦикла;
	
	Возврат ОтчетОбъект.ПолучитьМакет(СоответствиеНазваний[ОтчетОбъект.ВариантОтчета]).ПолучитьТекст();
	
КонецФункции

&НаСервере
Процедура СформироватьПакетыДанных()
	
	Если Отчет.ВыгружатьВXML ИЛИ Отчет.ВывестиПечатнуюФорму Тогда
		СформироватьПакетДанных(Отчет.ВариантОтчета);
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИмяФайлаОпераций(Организация, ИмяПакета, ДатаОкончания, ТекущийКаталог)
	
	Возврат ПланыВидовХарактеристик.ДополнительныеСведения.КаталогОтчетаДляОрганизации("ВнешниеОбработки._ОтчетностьВПФР." + ИмяПакета, Организация, ДатаОкончания, ТекущийКаталог);
	
КонецФункции // ПолучитьИмяФайлаОстатков

&НаСервере
Функция ПолучитьНаименованиеГоловнойОрганизации()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование КАК СокращенноеНаименование
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(&Период, ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)) КАК СвязанныеЮридическиеЛицаСрезПоследних
		|		ПО Организации.ЮрФизЛицо = СвязанныеЮридическиеЛицаСрезПоследних.ЮридическоеЛицо И СвязанныеЮридическиеЛицаСрезПоследних.Действует
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (ЕСТЬNULL(СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо, Организации.ЮрФизЛицо) = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
		|ГДЕ
		|	Организации.Ссылка = &Организация";
	
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("Организация", Отчет.Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СокращенноеНаименование;
	КонецЕсли;
		
КонецФункции

#КонецОбласти
